/*
杨辉三角形就是这个样子的：

             1
           1   1
         1   2   1
       1   3   3   1
     1   4   6   4   1
   …………………………

………………………………
  为了大家方便，消去每行前面的空格，只需要这个样子：
  1
  1   1
  1   2   1
  1   3   3   1
  1   4   6   4   1
  以上是5层的三角形，现在给出n（n<=30)，要求打印n层的三角形
  注意：每行两个数之间一个空格，最后一个数没有空格。
【输入格式】
一行一个整数n。
【输出格式】
如题意的杨辉三角形。
*/

#include <stdio.h>
int f[31][31];
int main ()
{
    int i,j,n;
    scanf("%d",&n);
    for(i=1;i<=n;i++)f[i][1]=1;
    for(i=1;i<=n;i++)f[i][i]=1;
    for(i=3;i<=n;i++)
    {
        for(j=2;j<=i-1;j++)
        {
            f[i][j]=f[i-1][j-1]+f[i-1][j];
        }
    }
    for(i=1;i<=n;i++)
    {
        for(j=1;j<=i-1;j++)
        {
            printf("%d ",f[i][j]);
        }
        printf("%d\n",f[i][i]);
    }
    return 0;
}
